**Â§ç‰π†Ôºö**Êï∞ÊçÆÂàÜÊûêÁöÑÁ¨¨‰∏ÄÊ≠•ÔºåÂä†ËΩΩÊï∞ÊçÆÊàë‰ª¨Â∑≤ÁªèÂ≠¶‰π†ÂÆåÊØï‰∫Ü„ÄÇÂΩìÊï∞ÊçÆÂ±ïÁé∞Âú®Êàë‰ª¨Èù¢ÂâçÁöÑÊó∂ÂÄôÔºåÊàë‰ª¨ÊâÄË¶ÅÂÅöÁöÑÁ¨¨‰∏ÄÊ≠•Â∞±ÊòØËÆ§ËØÜ‰ªñÔºå‰ªäÂ§©Êàë‰ª¨Ë¶ÅÂ≠¶‰π†ÁöÑÂ∞±ÊòØ**‰∫ÜËß£Â≠óÊÆµÂê´‰πâ‰ª•ÂèäÂàùÊ≠•ËßÇÂØüÊï∞ÊçÆ**„ÄÇ

## 1 Á¨¨‰∏ÄÁ´†ÔºöÊï∞ÊçÆËΩΩÂÖ•ÂèäÂàùÊ≠•ËßÇÂØü

### 1.4 Áü•ÈÅì‰Ω†ÁöÑÊï∞ÊçÆÂè´‰ªÄ‰πà
Êàë‰ª¨Â≠¶‰π†pandasÁöÑÂü∫Á°ÄÊìç‰ΩúÔºåÈÇ£‰πà‰∏ä‰∏ÄËäÇÈÄöËøápandasÂä†ËΩΩ‰πãÂêéÁöÑÊï∞ÊçÆÔºåÂÖ∂Êï∞ÊçÆÁ±ªÂûãÊòØ‰ªÄ‰πàÂë¢Ôºü

**ÂºÄÂßãÂâçÂØºÂÖ•numpyÂíåpandas**

In [1]:
import numpy as np
import pandas as pd

#### 1.4.1 ‰ªªÂä°‰∏ÄÔºöpandas‰∏≠Êúâ‰∏§‰∏™Êï∞ÊçÆÁ±ªÂûãDateFrameÂíåSeriesÔºåÈÄöËøáÊü•ÊâæÁÆÄÂçï‰∫ÜËß£‰ªñ‰ª¨„ÄÇÁÑ∂ÂêéËá™Â∑±ÂÜô‰∏Ä‰∏™ÂÖ≥‰∫éËøô‰∏§‰∏™Êï∞ÊçÆÁ±ªÂûãÁöÑÂ∞è‰æãÂ≠êüå∞[ÂºÄÊîæÈ¢ò]

In [2]:
#ÂÜôÂÖ•‰ª£Á†Å

data = range(10,0,-1)
example_2 = pd.Series(data)
example_2

0    10
1     9
2     8
3     7
4     6
5     5
6     4
7     3
8     2
9     1
dtype: int64

In [3]:
#ËØæÊú¨‰æãÂ≠ê
sdata = {'Ohio': 35000, 'Texas': 71000, 'Oregon': 16000, 'Utah': 5000}
example_1 = pd.Series(sdata)
example_1

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [4]:
#ËØæÊú¨‰æãÂ≠ê
data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada'],
        'year': [2000, 2001, 2002, 2001, 2002, 2003],'pop': [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}
example_2 = pd.DataFrame(data)
example_2

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

#### 1.4.2 ‰ªªÂä°‰∫åÔºöÊ†πÊçÆ‰∏äËäÇËØæÁöÑÊñπÊ≥ïËΩΩÂÖ•"train.csv"Êñá‰ª∂

In [5]:
#ÂÜôÂÖ•‰ª£Á†Å
data = pd.read_csv("train.csv")
data

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

‰πüÂèØ‰ª•Âä†ËΩΩ‰∏ä‰∏ÄËäÇËØæ‰øùÂ≠òÁöÑ"train_chinese.csv"Êñá‰ª∂„ÄÇÈÄöËøáÁøªËØëÁâàtrain_chinese.csvÁÜüÊÇâ‰∫ÜËøô‰∏™Êï∞ÊçÆÈõÜÔºåÁÑ∂ÂêéÊàë‰ª¨ÂØπtrian.csvÊù•ËøõË°åÊìç‰Ωú
#### 1.4.3 ‰ªªÂä°‰∏âÔºöÊü•ÁúãDataFrameÊï∞ÊçÆÁöÑÊØèÂàóÁöÑÂêçÁß∞

In [6]:
#ÂÜôÂÖ•‰ª£Á†Å
data.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

#### 1.4.4‰ªªÂä°ÂõõÔºöÊü•Áúã"Cabin"ËøôÂàóÁöÑÊâÄÊúâÂÄº[ÊúâÂ§öÁßçÊñπÊ≥ï]

In [7]:
#ÂÜôÂÖ•‰ª£Á†Å
data["Cabin"]

0       NaN
1       C85
2       NaN
3      C123
4       NaN
       ...
886     NaN
887     B42
888     NaN
889    C148
890     NaN
Name: Cabin, Length: 891, dtype: object

In [8]:
#ÂÜôÂÖ•‰ª£Á†Å
data.Cabin

0       NaN
1       C85
2       NaN
3      C123
4       NaN
       ...
886     NaN
887     B42
888     NaN
889    C148
890     NaN
Name: Cabin, Length: 891, dtype: object

#### 1.4.5 ‰ªªÂä°‰∫îÔºöÂä†ËΩΩÊñá‰ª∂"test_1.csv"ÔºåÁÑ∂ÂêéÂØπÊØî"train.csv"ÔºåÁúãÁúãÊúâÂì™‰∫õÂ§öÂá∫ÁöÑÂàóÔºåÁÑ∂ÂêéÂ∞ÜÂ§öÂá∫ÁöÑÂàóÂà†Èô§
ÁªèËøáÊàë‰ª¨ÁöÑËßÇÂØüÂèëÁé∞‰∏Ä‰∏™ÊµãËØïÈõÜtest_1.csvÊúâ‰∏ÄÂàóÊòØÂ§ö‰ΩôÁöÑÔºåÊàë‰ª¨ÈúÄË¶ÅÂ∞ÜËøô‰∏™Â§ö‰ΩôÁöÑÂàóÂà†Âéª

In [10]:
#ÂÜôÂÖ•‰ª£Á†Å
test_csv = pd.read_csv("test_1.csv")
test_csv

,Unnamed: 0,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,a
0,0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,100
1,1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,100
2,2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,100
3,3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,100
4,4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,100
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S,100
887,887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S,100
888,888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S,100
889,889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C,100
890,890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q,100

In [11]:
#ÂÜôÂÖ•‰ª£Á†Å
del test_csv["a"]

In [12]:
test_csv

,Unnamed: 0,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

„ÄêÊÄùËÄÉ„ÄëËøòÊúâÂÖ∂‰ªñÁöÑÂà†Èô§Â§ö‰ΩôÁöÑÂàóÁöÑÊñπÂºèÂêóÔºü

In [13]:
# ÊÄùËÄÉÂõûÁ≠î Â•ΩÂÉèÊàëÂÜôÁöÑdropÂáΩÊï∞Âè™ËÉΩÈöêËóè
test_csv2 = pd.read_csv("test_1.csv")

test_csv2.drop(["a"],axis=1)

,Unnamed: 0,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

#### 1.4.6 ‰ªªÂä°ÂÖ≠Ôºö Â∞Ü['PassengerId','Name','Age','Ticket']ËøôÂá†‰∏™ÂàóÂÖÉÁ¥†ÈöêËóèÔºåÂè™ËßÇÂØüÂÖ∂‰ªñÂá†‰∏™ÂàóÂÖÉÁ¥†

In [14]:
#ÂÜôÂÖ•‰ª£Á†Å
test_csv.drop(['PassengerId','Name','Age','Ticket'],axis=1)

,Unnamed: 0,Survived,Pclass,Sex,SibSp,Parch,Fare,Cabin,Embarked
0,0,0,3,male,1,0,7.2500,NaN,S
1,1,1,1,female,1,0,71.2833,C85,C
2,2,1,3,female,0,0,7.9250,NaN,S
3,3,1,1,female,1,0,53.1000,C123,S
4,4,0,3,male,0,0,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...
886,886,0,2,male,0,0,13.0000,NaN,S
887,887,1,1,female,0,0,30.0000,B42,S
888,888,0,3,female,1,2,23.4500,NaN,S
889,889,1,1,male,0,0,30.0000,C148,C
890,890,0,3,male,0,0,7.7500,NaN,Q

„ÄêÊÄùËÄÉ„ÄëÂØπÊØî‰ªªÂä°‰∫îÂíå‰ªªÂä°ÂÖ≠ÔºåÊòØ‰∏çÊòØ‰ΩøÁî®‰∫Ü‰∏ç‰∏ÄÊ†∑ÁöÑÊñπÊ≥ï(ÂáΩÊï∞)ÔºåÂ¶ÇÊûú‰ΩøÁî®‰∏ÄÊ†∑ÁöÑÂáΩÊï∞Â¶Ç‰ΩïÂÆåÊàê‰∏äÈù¢ÁöÑ‰∏çÂêåÁöÑË¶ÅÊ±ÇÂë¢Ôºü

„ÄêÊÄùËÄÉÂõûÁ≠î„Äë

Â¶ÇÊûúÊÉ≥Ë¶ÅÂÆåÂÖ®ÁöÑÂà†Èô§‰Ω†ÁöÑÊï∞ÊçÆÁªìÊûÑÔºå‰ΩøÁî®inplace=TrueÔºåÂõ†‰∏∫‰ΩøÁî®inplaceÂ∞±Â∞ÜÂéüÊï∞ÊçÆË¶ÜÁõñ‰∫ÜÔºåÊâÄ‰ª•ËøôÈáåÊ≤°ÊúâÁî®

### 1.5 Á≠õÈÄâÁöÑÈÄªËæë

Ë°®Ê†ºÊï∞ÊçÆ‰∏≠ÔºåÊúÄÈáçË¶ÅÁöÑ‰∏Ä‰∏™ÂäüËÉΩÂ∞±ÊòØË¶ÅÂÖ∑ÊúâÂèØÁ≠õÈÄâÁöÑËÉΩÂäõÔºåÈÄâÂá∫ÊàëÊâÄÈúÄË¶ÅÁöÑ‰ø°ÊÅØÔºå‰∏¢ÂºÉÊó†Áî®ÁöÑ‰ø°ÊÅØ„ÄÇ

‰∏ãÈù¢Êàë‰ª¨ËøòÊòØÁî®ÂÆûÊàòÊù•Â≠¶‰π†pandasËøô‰∏™ÂäüËÉΩ„ÄÇ

#### 1.5.1 ‰ªªÂä°‰∏ÄÔºö Êàë‰ª¨‰ª•"Age"‰∏∫Á≠õÈÄâÊù°‰ª∂ÔºåÊòæÁ§∫Âπ¥ÈæÑÂú®10Â≤Å‰ª•‰∏ãÁöÑ‰πòÂÆ¢‰ø°ÊÅØ„ÄÇ

In [15]:
#ÂÜôÂÖ•‰ª£Á†Å
test_csv[test_csv["Age"]<10]

,Unnamed: 0,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
7,7,8,0,3,"Palsson, Master. Gosta Leonard",male,2.00,3,1,349909,21.0750,NaN,S
10,10,11,1,3,"Sandstrom, Miss. Marguerite Rut",female,4.00,1,1,PP 9549,16.7000,G6,S
16,16,17,0,3,"Rice, Master. Eugene",male,2.00,4,1,382652,29.1250,NaN,Q
24,24,25,0,3,"Palsson, Miss. Torborg Danira",female,8.00,3,1,349909,21.0750,NaN,S
43,43,44,1,2,"Laroche, Miss. Simonne Marie Anne Andree",female,3.00,1,2,SC/Paris 2123,41.5792,NaN,C
...,...,...,...,...,...,...,...,...,...,...,...,...,...
827,827,828,1,2,"Mallet, Master. Andre",male,1.00,0,2,S.C./PARIS 2079,37.0042,NaN,C
831,831,832,1,2,"Richards, Master. George Sibley",male,0.83,1,1,29106,18.7500,NaN,S
850,850,851,0,3,"Andersson, Master. Sigvard Harald Elias",male,4.00,4,2,347082,31.2750,NaN,S
852,852,853,0,3,"Boulos, Miss. Nourelain",female,9.00,1,1,2678,15.2458,NaN,C
869,869,870,1,3,"Johnson, Master. Harold Theodor",male,4.00,1,1,347742,11.1333,NaN,S

#### 1.5.2 ‰ªªÂä°‰∫åÔºö ‰ª•"Age"‰∏∫Êù°‰ª∂ÔºåÂ∞ÜÂπ¥ÈæÑÂú®10Â≤Å‰ª•‰∏äÂíå50Â≤Å‰ª•‰∏ãÁöÑ‰πòÂÆ¢‰ø°ÊÅØÊòæÁ§∫Âá∫Êù•ÔºåÂπ∂Â∞ÜËøô‰∏™Êï∞ÊçÆÂëΩÂêç‰∏∫midage

In [19]:
#ÂÜôÂÖ•‰ª£Á†Å
midage = test_csv[(test_csv["Age"]>10)&(test_csv["Age"]<50)]
midage

,Unnamed: 0,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...,...
885,885,886,0,3,"Rice, Mrs. William (Margaret Norton)",female,39.0,0,5,382652,29.1250,NaN,Q
886,886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
889,889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

„ÄêÊèêÁ§∫„Äë‰∫ÜËß£pandasÁöÑÊù°‰ª∂Á≠õÈÄâÊñπÂºè‰ª•ÂèäÂ¶Ç‰Ωï‰ΩøÁî®‰∫§ÈõÜÂíåÂπ∂ÈõÜÊìç‰Ωú

#### 1.5.3 ‰ªªÂä°‰∏âÔºöÂ∞ÜmidageÁöÑÊï∞ÊçÆ‰∏≠Á¨¨100Ë°åÁöÑ"Pclass"Âíå"Sex"ÁöÑÊï∞ÊçÆÊòæÁ§∫Âá∫Êù•

In [26]:
#ÂÜôÂÖ•‰ª£Á†Å

#ÂÖàÈáçÁΩÆÁ¥¢Âºï
midage = midage.reset_index(drop=True)
# midage

#ÊòæÁ§∫Á¨¨100Ë°åÁöÑ"Pclass"Âíå"Sex"ÁöÑÊï∞ÊçÆ
# midage.loc[100,["Pclass","Sex"]]
midage.loc[[100],["Pclass","Sex"]]

     Pclass   Sex
100       2  male

„ÄêÊèêÁ§∫„ÄëÂú®ÊäΩÂèñÊï∞ÊçÆ‰∏≠ÔºåÊàë‰ª¨Â∏åÊúõÊï∞ÊçÆÁöÑÁõ∏ÂØπÈ°∫Â∫è‰øùÊåÅ‰∏çÂèòÔºåÁî®‰ªÄ‰πàÂáΩÊï∞ÂèØ‰ª•ËææÂà∞Ëøô‰∏™ÊïàÊûúÂë¢Ôºü

ÂõûÁ≠îÔºö
midage.reset_index(drop=True)
Áî®Êù•ÈáçÁΩÆÁ¥¢Âºï

#### 1.5.4 ‰ªªÂä°ÂõõÔºö‰ΩøÁî®locÊñπÊ≥ïÂ∞ÜmidageÁöÑÊï∞ÊçÆ‰∏≠Á¨¨100Ôºå105Ôºå108Ë°åÁöÑ"Pclass"Ôºå"Name"Âíå"Sex"ÁöÑÊï∞ÊçÆÊòæÁ§∫Âá∫Êù•

In [27]:
#ÂÜôÂÖ•‰ª£Á†Å
midage.loc[[100,105,108],["Pclass","Name","Sex"]]

     Pclass                               Name   Sex
100       2  Byles, Rev. Thomas Roussel Davids  male
105       3           Cribb, Mr. John Hatfield  male
108       3                    Calic, Mr. Jovo  male

#### 1.5.5 ‰ªªÂä°‰∫îÔºö‰ΩøÁî®ilocÊñπÊ≥ïÂ∞ÜmidageÁöÑÊï∞ÊçÆ‰∏≠Á¨¨100Ôºå105Ôºå108Ë°åÁöÑ"Pclass"Ôºå"Name"Âíå"Sex"ÁöÑÊï∞ÊçÆÊòæÁ§∫Âá∫Êù•

In [30]:
#ÂÜôÂÖ•‰ª£Á†Å
# midage.iloc[[100,105,108],["Pclass","Name","Sex"]] #Êä•Èîô
midage.iloc[[100,105,108],[2,3,4]]

     Survived  Pclass                               Name
100         0       2  Byles, Rev. Thomas Roussel Davids
105         0       3           Cribb, Mr. John Hatfield
108         0       3                    Calic, Mr. Jovo

„ÄêÊÄùËÄÉ„ÄëÂØπÊØî`iloc`Âíå`loc`ÁöÑÂºÇÂêå

ilocÂú®ÂàóÂêçÂ§ÑÂÜôÂàóÁöÑÁ¥¢ÂºïindexÔºålocÂÜôÂàóÂêç